## Plan Result (perftest - TerraformPlanApply)




<pre><code>Plan: 16 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.perftest-internal.azurerm_private_dns_a_record.this[&#34;ccd-data-0&#34;]
  * module.perftest-internal.azurerm_private_dns_a_record.this[&#34;ccd-data-1&#34;]
  * module.perftest-internal.azurerm_private_dns_a_record.this[&#34;ccd-data-2&#34;]
  * module.perftest-internal.azurerm_private_dns_a_record.this[&#34;ccd-data-3&#34;]
  * module.perftest-internal.azurerm_private_dns_zone.zone[0]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;cftperftest&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;cftptl&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-cftptl-intsvc-vnet&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-perftest-internal&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-perftest-internal&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;dynatrace-activegate-vnet-nonprod&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;private-dns-resolver-uksouth-vnet-prod-int&#34;]
  * module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;vpn&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.perftest-internal.azurerm_private_dns_a_record.this["ccd-data-0"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccd-data-0"
      + records             = [
          + "10.112.153.7",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-perftest.internal"
    }

  # module.perftest-internal.azurerm_private_dns_a_record.this["ccd-data-1"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccd-data-1"
      + records             = [
          + "10.112.153.6",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-perftest.internal"
    }

  # module.perftest-internal.azurerm_private_dns_a_record.this["ccd-data-2"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccd-data-2"
      + records             = [
          + "10.112.153.9",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-perftest.internal"
    }

  # module.perftest-internal.azurerm_private_dns_a_record.this["ccd-data-3"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccd-data-3"
      + records             = [
          + "10.112.153.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-perftest.internal"
    }

  # module.perftest-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-perftest.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }

      + soa_record (known after apply)
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["cftperftest"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "cftperftest"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/virtualNetworks/cft-perftest-vnet"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["cftptl"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "cftptl"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-cftptl-intsvc-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-cftptl-intsvc-vnet"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/aks-infra-cftptl-intsvc-rg/providers/Microsoft.Network/virtualNetworks/core-cftptl-intsvc-vnet"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-perftest-internal"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-perftest"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-perftest-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-perftest-internal"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-perftest/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-perftest"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["dynatrace-activegate-vnet-nonprod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "dynatrace-activegate-vnet-nonprod"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/dynatrace-activegate-nonprod/providers/Microsoft.Network/virtualNetworks/dynatrace-activegate-vnet-nonprod"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["private-dns-resolver-uksouth-vnet-prod-int"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "private-dns-resolver-uksouth-vnet-prod-int"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/private-dns-resolver-uksouth-prod-int/providers/Microsoft.Network/virtualNetworks/private-dns-resolver-uksouth-vnet-prod-int"
    }

  # module.perftest-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["vpn"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "vpn"
      + private_dns_zone_name = "service.core-compute-perftest.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
          + "startupMode"  = "always"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/mgmt-vpn-2-mgmt/providers/Microsoft.Network/virtualNetworks/mgmt-vpn-2-vnet"
    }

Plan: 16 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":870,"Program":"tfcmt","SHA1":"","Target":"perftest - TerraformPlanApply","Vars":{}} -->